Accessing DataFrame using Index and slicing

In [21]:
import pandas as pd
df = pd.read_csv('c:/users/rakesh/desktop/Notes/pandascode/student.csv')
print(df)

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

In [3]:
print(df[1]) #since dataframe contains rows and columns

    name  english  math  cs  physics  chemistry
1   amit       56    89  56       67         87
2     jm       45    45  89       67         66
3  vikas       34    67  89       78         67

In [4]:
print(df[1:5:2])

    name  english  math  cs  physics  chemistry
1   amit       56    89  56       67         87
3  vikas       34    67  89       78         67

In [5]:
print(df['name'])

0    rakesh
1      amit
2        jm
3     vikas
4        rk
5     dhruv
Name: name, dtype: object

In [9]:
print(df[['name','english']])  # only list of column name is allowed

     name  english
0  rakesh       45
1    amit       56
2      jm       45
3   vikas       34
4      rk       67
5   dhruv       78

In [20]:
df.iloc[:,[1,5]]

   english  chemistry
0       45         78
1       56         87
2       45         66
3       34         67
4       67         45
5       78         56